/*-----------------------------------------------------------------------------------------------
	名前	PPNormalFont.h
	説明		        
	作成	2012.07.22 by H.Yamaguchi
	更新
-----------------------------------------------------------------------------------------------*/

#ifndef __PPNormalFont_h__
#define __PPNormalFont_h__

/*-----------------------------------------------------------------------------------------------
	インクルードファイル
-----------------------------------------------------------------------------------------------*/

#include "PPFont.h"

/*-----------------------------------------------------------------------------------------------
	クラス
-----------------------------------------------------------------------------------------------*/

class PPNormalFont : public PPFont {
public:
	PPNormalFont(PPWorld* world,int _fontWidth=16,int _fontHeight=16) : PPFont(world) {
		fontWidth = _fontWidth;
		fontHeight = _fontHeight;
	}
	virtual float height();
	
protected:
	virtual float __print(PPWorld* _target,float x,float y,float scale,const char* str);
	int fontWidth;
	int fontHeight;
	
	void moveCursor(float dx,float dy);
};

#endif

/*-----------------------------------------------------------------------------------------------
	このファイルはここまで
-----------------------------------------------------------------------------------------------*/
