/*-----------------------------------------------------------------------------------------------
	名前	PPGameButton.h
	説明		        
	作成	2012.07.22 by H.Yamaguchi
	更新
-----------------------------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------------------------
	インクルードファイル
-----------------------------------------------------------------------------------------------*/

#include "PPGameDef.h"

#pragma once

/*-----------------------------------------------------------------------------------------------
	プロトタイプ宣言
-----------------------------------------------------------------------------------------------*/

short PPGame_CharDeltaX(PPGameImage* patternMaster,int group,int pat);
short PPGame_CharDeltaY(PPGameImage* patternMaster,int group,int pat);
short PPGame_CharDeltaW(PPGameImage* patternMaster,int group,int pat);
short PPGame_CharDeltaH(PPGameImage* patternMaster,int group,int pat);

/*-----------------------------------------------------------------------------------------------
	クラス
-----------------------------------------------------------------------------------------------*/

class GLButton {
public:
	GLButton(PPGameImage* _group,int _image,int _pat) {
		group = _group;
		image = _image;
		pat = _pat;
		dx = 0;
		dy = 0;
	}
	PPGameImage* group;
	int image;
	int pat;
	float dx;
	float dy;
};

/*-----------------------------------------------------------------------------------------------
	このファイルはここまで
-----------------------------------------------------------------------------------------------*/
